Revit 2025 API
WireType.TemperatureRating Property
 The temperature rating type of the wire type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public TemperatureRatingType TemperatureRating { get; set; }
Public Property TemperatureRating As TemperatureRatingType
	Get
	Set
public:
property TemperatureRatingType^ TemperatureRating {
	TemperatureRatingType^ get ();
	void set (TemperatureRatingType^ value);
}
member TemperatureRating : TemperatureRatingType with get, set
Property Value
TemperatureRatingType
Remarks
Should retrieved from relevant WireMaterial object.
See Also
Reference
WireType Class
Autodesk.Revit.DB.Electrical Namespace